{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Happy",
    "1": "Fear",
    "2": "Sadness",
    "3": "Disgust",
    "4": "Surprise",
    "5": "Anger",
    "6": "Ambigious"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Ambigious": 6,
    "Anger": 5,
    "Disgust": 3,
    "Fear": 1,
    "Happy": 0,
    "Sadness": 2,
    "Surprise": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
